<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"4db7d5b2b1cc0a63f64c34c0dfcb597ec27b486e79360b7cef0b9ad60afeea16","plan_job_ref":"Job Terraform Plan #12 at https://github.com/cal-itp/data-infra/actions/runs/13446680380","plan_out_hash":"a23bff924ad5b95e184e226250aa46d34442e8edefec6292df2045d007cfdf73","plan_hash":"b8fd08a4ed193a592f5868d3558eef996e26bb9e8b7719de9df636d0de0ed69e","plan_text_format":"diff","version":"1.46.1"} -->
Terraform plan in __iac/cal-itp-data-infra-staging/iam/us__
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # google_project_iam_member.tfer--pytest-membership will be created
+   resource "google_project_iam_member" "tfer--pytest-membership" {
+       etag    = (known after apply)
+       id      = (known after apply)
+       member  = (known after apply)
+       project = "cal-itp-data-infra-staging"
+       role    = "roles/storage.objectViewer"
    }

  # google_service_account.tfer--pytest will be created
+   resource "google_service_account" "tfer--pytest" {
+       account_id   = "*********************"
+       description  = "Service account for Github Actions to run tests"
+       disabled     = false
+       display_name = "pytest"
+       email        = (known after apply)
+       id           = (known after apply)
+       member       = (known after apply)
+       name         = (known after apply)
+       project      = "cal-itp-data-infra-staging"
+       unique_id    = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Terraform Plan #12](https://github.com/cal-itp/data-infra/actions/runs/13446680380)